update readme file
